return {
  'nvimdev/dashboard-nvim',
  event = 'VimEnter',
  config = function()
    require('dashboard').setup({
        theme = 'doom',    -- theme is doom and hyper default is hyper
        config = {
            header = {
"              ⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣤⣤⣤⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀             ",
"              ⠀ ⠀⠀⠀⠀⠀⢀⣤⠶⠟⠋⠉⠁⠀⠀⠀⠀⠉⠉⠛⠳⢦⣄⡀⠀⠀⠀⠀⠀⠀             ",
"               ⠀⠀⠀⠀⢀⡴⠋⠁⠀⠀⠀⠀⢀⣤⣾⣿⣆⠀⠀⠀⠀⠀⠈⠻⣦⡀⠀⠀⠀⠀             ",
"               ⠀⠀⠀⣴⠋⠀⠀⠀⠀⠀⣠⡶⠛⠁⣼⣿⣿⣆⠀⠀⠀⠀⠀⠀⠈⠻⣄⠀⠀⠀             ",
"               ⠀⠀⣼⠃⠀⠀⠀⠀⠀⣸⡏⠀⠀⣼⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⢹⣆⠀⠀             ",
"               ⠀⣸⡏⠀⠀⠀⠀⠀⢠⡿⠀⠀⣼⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⢿⡄⠀             ",
"               ⠀⣿⠁⠀⠀⠀⠀⠀⣾⠇⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣄⠀⠀⠀⢸⣧⠀             ",
"               ⠀⣿⠀⠀⠀⠀⠀⢰⡟⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠀⠀⢸⣿⠀             ",
"              ⠀ ⣿⡀⠀⠀⠀⠀⣿⠃⠀⠀⠀⢸⣿⣿⡿⠟⠉⣿⣿⣿⣿⣿⣿⣧⡀⠀⢸⡟⠀             ",
"               ⠀⢸⣧⣤⡴⠶⠛⠉⠀⠀⠀⠀⠸⠟⠉⠀⠀⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀             ",
"              ⠀ ⠀⢻⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀             ",
"              ⠀⠀ ⠀⠹⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣿⣿⣿⡿⠃⠀⠀⠀             ",
"            ⠀⠀ ⠀  ⠀⠈⠳⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⡿⠟⠁⠀⠀⠀⠀             ",
"           ⠀ ⠀⠀  ⠀ ⠀⠀⠈⠙⠳⢦⣤⣀⣀⣀⠀⠀⣀⣀⣿⣿⡿⠟⠉⠀⠀⠀⠀⠀⠀⠀             ",
"           ⠀⠀  ⠀ ⠀⠀ ⠀⠀⠀⠀⠀⠈⠉⠙⠛⠛⠛⠛⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀             ",
"              ▄▄▄▄ ▄▄                ▄▄                   ",
"▀███▀▀▀███  ▄█▀ ▀▀ ██ ▀████▀   ▀███▀ ██                   ",
"  ██    ▀█  ██▀         ▀██     ▄█                        ",
"  ██   █   █████ ▀███    ██▄   ▄█  ▀███ ▀████████▄█████▄  ",
"  ██████    ██     ██     ██▄  █▀    ██   ██    ██    ██  ",
"  ██   █  ▄ ██     ██     ▀██ █▀     ██   ██    ██    ██  ",
"  ██     ▄█ ██     ██      ▄██▄      ██   ██    ██    ██  ",
"▄██████████████▄ ▄████▄     ██     ▄████▄████  ████  ████▄",
"                                                          ",
"                                                          ",
            },
            center = {
                { icon = "  ", desc = " Find File", action = "Telescope find_files", key = "f" },
                { icon = "  ", desc = " Recent Files", action = "Telescope oldfiles", key = "r" },
                { icon = "  ", desc = " Find Word", action = "Telescope live_grep", key = "g" },
                { icon = "  ", desc = " Config", action = "e ~/.config/nvim/init.lua", key = "c" },
                { icon = "  ", desc = " Quit", action = "qa", key = "q" },
            },
            footer = { "🏔️  EfiVim - Code Higher" }, -- Custom footer text
            vertical_center = false, -- Center the Dashboard on the vertical (from top to bottom)
        }
    })
  end,
  dependencies = { {'nvim-tree/nvim-web-devicons'}}
}
