return {
  'nvimdev/dashboard-nvim',
  event = 'VimEnter',
  config = function()
    require('dashboard').setup({
        theme = 'doom',    -- theme is doom and hyper default is hyper
        config = {
            header = {
"              ⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣤⣤⣤⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀             ",
"              ⠀ ⠀⠀⠀⠀⠀⢀⣤⠶⠟⠋⠉⠁⠀⠀⠀⠀⠉⠉⠛⠳⢦⣄⡀⠀⠀⠀⠀⠀⠀             ",
"               ⠀⠀⠀⠀⢀⡴⠋⠁⠀⠀⠀⠀⢀⣤⣾⣿⣆⠀⠀⠀⠀⠀⠈⠻⣦⡀⠀⠀⠀⠀             ",
"               ⠀⠀⠀⣴⠋⠀⠀⠀⠀⠀⣠⡶⠛⠁⣼⣿⣿⣆⠀⠀⠀⠀⠀⠀⠈⠻⣄⠀⠀⠀             ",
"               ⠀⠀⣼⠃⠀⠀⠀⠀⠀⣸⡏⠀⠀⣼⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⢹⣆⠀⠀             ",
"               ⠀⣸⡏⠀⠀⠀⠀⠀⢠⡿⠀⠀⣼⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⢿⡄⠀             ",
"               ⠀⣿⠁⠀⠀⠀⠀⠀⣾⠇⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣄⠀⠀⠀⢸⣧⠀             ",
"               ⠀⣿⠀⠀⠀⠀⠀⢰⡟⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠀⠀⢸⣿⠀             ",
"              ⠀ ⣿⡀⠀⠀⠀⠀⣿⠃⠀⠀⠀⢸⣿⣿⡿⠟⠉⣿⣿⣿⣿⣿⣿⣧⡀⠀⢸⡟⠀             ",
"               ⠀⢸⣧⣤⡴⠶⠛⠉⠀⠀⠀⠀⠸⠟⠉⠀⠀⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀             ",
"              ⠀ ⠀⢻⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀             ",
"              ⠀⠀ ⠀⠹⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣿⣿⣿⡿⠃⠀⠀⠀             ",
"            ⠀⠀ ⠀  ⠀⠈⠳⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⡿⠟⠁⠀⠀⠀⠀             ",
"           ⠀ ⠀⠀  ⠀ ⠀⠀⠈⠙⠳⢦⣤⣀⣀⣀⠀⠀⣀⣀⣿⣿⡿⠟⠉⠀⠀⠀⠀⠀⠀⠀             ",
"           ⠀⠀  ⠀ ⠀⠀ ⠀⠀⠀⠀⠀⠈⠉⠙⠛⠛⠛⠛⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀             ",
"              ▄▄▄▄ ▄▄                ▄▄                   ",
"▀███▀▀▀███  ▄█▀ ▀▀ ██ ▀████▀   ▀███▀ ██                   ",
"  ██    ▀█  ██▀         ▀██     ▄█                        ",
"  ██   █   █████ ▀███    ██▄   ▄█  ▀███ ▀████████▄█████▄  ",
"  ██████    ██     ██     ██▄  █▀    ██   ██    ██    ██  ",
"  ██   █  ▄ ██     ██     ▀██ █▀     ██   ██    ██    ██  ",
"  ██     ▄█ ██     ██      ▄██▄      ██   ██    ██    ██  ",
"▄██████████████▄ ▄████▄     ██     ▄████▄████  ████  ████▄",
"                                                          ",
"                                                          ",
            },
            center = {
              {
                icon = "󰈞  ",
                desc = "Find  File                              ",
                action = "Telescope find_files",
                key = "f",
              },
              {
                icon = "󰈢  ",
                desc = "Recently opened files                   ",
                action = "Telescope oldfiles",
                key = "r",
              },
              {
                icon = "󰈬  ",
                desc = "Project grep                            ",
                action = "Leaderf rg --popup",
                key = "g",
              },
              {
                icon = "  ",
                desc = "Open Nvim config                        ",
                action = "tabnew $MYVIMRC | tcd %:p:h",
                key = "c",
              },
              {
                icon = "  ",
                desc = "New file                                ",
                action = "enew",
                key = "n",
              },
              {
                icon = "󰗼  ",
                desc = "Quit Nvim                               ",
                action = "qa",
                key = "q",
              },
            },
            footer = { "🏔️  EfiVim - Code Higher" }, -- Custom footer text
            vertical_center = false, -- Center the Dashboard on the vertical (from top to bottom)
        }
    })
  end,
  dependencies = { {'nvim-tree/nvim-web-devicons'}}
}
